src/config/Documents/ПереносДЗКЗпоПерегрузамИНедогрузам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ПереносДЗКЗпоПерегрузамИНедогрузам</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПерегрузНедогруз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорИзОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ВидыОперацийПерегрузНедогруз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПерегрузНедогруз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перегруз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недогруз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ПереносДЗКЗпоПерегрузамИНедогрузам/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Список = Новый СписокЗначений();
	Список.Добавить(Перечисления.ВидыОперацийПерегрузНедогруз.Недогруз);
	Список.Добавить(Перечисления.ВидыОперацийПерегрузНедогруз.Перегруз);
	ВыбранныйВидОперации = Список.ВыбратьЭлемент("Выберите вид операции.");
	Если ВыбранныйВидОперации = Неопределено тогда
		ВидОперации = Перечисления.ВидыОперацийПерегрузНедогруз.Недогруз;
	иначе
		ВидОперации = ВыбранныйВидОперации.Значение;
	конецЕсли;	
	
	
	
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		Основание = ДанныеЗаполнения.Ссылка;
		ДоговорИзОснования = ДанныеЗаполнения.Ссылка.ДоговорКонтрагента;
		Контрагент = ДанныеЗаполнения.Ссылка.Контрагент;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заказ",Основание);
		запрос.Текст = "ВЫБРАТЬ
		|	ЗаказыПоставщикамОбороты.ЗаказПоставщику,
		|	ЗаказыПоставщикамОбороты.Номенклатура,
		|	ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоПриход, 0) КАК КоличествоПриход,
		|	ЕСТЬNULL(ЗаказыПоставщикамОбороты.КоличествоРасход, 0) КАК КоличествоРасход,
		|	ЕСТЬNULL(ЗаказыПоставщикамОбороты.СуммаВзаиморасчетовПриход, 0) КАК СуммаВзаиморасчетовПриход,
		|	ЕСТЬNULL(ЗаказыПоставщикамОбороты.СуммаВзаиморасчетовРасход, 0) КАК СуммаВзаиморасчетовРасход,
		|	ЗаказыПоставщикамОбороты.Регистратор,
		|	ЗаказыПоставщикамОбороты.ДоговорКонтрагента.Владелец,
		|	ЗаказыПоставщикамОбороты.ДоговорКонтрагента
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Обороты(, , Регистратор, ЗаказПоставщику = &Заказ) КАК ЗаказыПоставщикамОбороты
		|ГДЕ
		|	(ЗаказыПоставщикамОбороты.Регистратор ССЫЛКА Документ.ЗаказПоставщику
		|			ИЛИ ЗаказыПоставщикамОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Данные.ЗаказПоставщику
		|ПОМЕСТИТЬ НужныеЗаказы
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	Данные.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ЗаказПоставщику,
		|	Данные.Номенклатура,
		|	СУММА(Данные.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(Данные.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(Данные.СуммаВзаиморасчетовПриход) КАК СуммаВзаиморасчетовПриход,
		|	СУММА(Данные.СуммаВзаиморасчетовРасход) КАК СуммаВзаиморасчетовРасход
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	Данные.ЗаказПоставщику В
		|			(ВЫБРАТЬ
		|				НужныеЗаказы.ЗаказПоставщику
		|			ИЗ
		|				НужныеЗаказы КАК НужныеЗаказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.ЗаказПоставщику,
		|	Данные.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.ЗаказПоставщику,
		|	Итог.Номенклатура,
		|	Итог.КоличествоПриход,
		|	Итог.КоличествоРасход,
		|	Итог.СуммаВзаиморасчетовПриход,
		|	Итог.СуммаВзаиморасчетовРасход
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	Итог.КоличествоПриход - Итог.КоличествоРасход "+?(ВидОперации = Перечисления.ВидыОперацийПерегрузНедогруз.Перегруз,"<",">")+" 0";
		
		результат = Запрос.Выполнить().Выгрузить();
		
		коф = ?(ВидОперации = Перечисления.ВидыОперацийПерегрузНедогруз.Перегруз,-1,1);
		Для Каждого ТекСтрокаТовары Из результат Цикл
			НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество = коф*(ТекСтрокаТовары.КоличествоПриход - ТекСтрокаТовары.КоличествоРасход);
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.Сумма = коф*(ТекСтрокаТовары.СуммаВзаиморасчетовПриход - ТекСтрокаТовары.СуммаВзаиморасчетовРасход);
				НоваяСтрока.Цена = (ТекСтрокаТовары.СуммаВзаиморасчетовПриход - ТекСтрокаТовары.СуммаВзаиморасчетовРасход) / (ТекСтрокаТовары.КоличествоПриход - ТекСтрокаТовары.КоличествоРасход);
		КонецЦикла;
КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	если не ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		отказ = Истина;
		Сообщить("Заполните договор!!!");
		Возврат;
	КонецЕсли;
	
	
		
	Если ВидОперации = Перечисления.ВидыОперацийПерегрузНедогруз.Перегруз Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
	иначе	
		ВидДвижения = ВидДвиженияНакопления.Приход;
	конецесли;	

		
		
		СуммаИтог = Товары.итог("Сумма");
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движения.ВзаиморасчетыСКонтрагентами.Очистить();
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвижения;
		Движение.Период = Дата;
		Движение.ДоговорКонтрагента = ДоговорИзОснования;
		Движение.Сделка = Основание;
		Движение.СуммаВзаиморасчетов = -СуммаИтог;
		Движение.СуммаУпр = -СуммаИтог*КурсВзаиморасчетов;
		
		Движение2 = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение2.ВидДвижения = ВидДвижения;
		Движение2.Период = Дата;
		Движение2.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение2.Сделка = Основание;
		Движение2.СуммаВзаиморасчетов = СуммаИтог;
		Движение2.СуммаУпр = СуммаИтог*КурсВзаиморасчетов;
		
		//теперь рассчитаем курсовые разницы
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			&МоментВремени,
		|			ДоговорКонтрагента = &Договор
		|				И Сделка = &Сделка) КАК ВзаиморасчетыСКонтрагентамиОстатки";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Сделка", Основание);
		Запрос.УстановитьПараметр("Договор", ДоговорИзОснования);
		
		
		ТаблицаКурсовыхРазниц = Запрос.Выполнить().Выгрузить();
		к =?(ВидОперации = Перечисления.ВидыОперацийПерегрузНедогруз.Перегруз,1,-1); 
		Если ТаблицаКурсовыхРазниц[0].СуммаВзаиморасчетовОстаток+К*СуммаИтог =0  и ТаблицаКурсовыхРазниц[0].СуммаУпрОстаток+К*СуммаИтог*КурсВзаиморасчетов<>0  тогда
        Движение3 = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение3.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение3.Период = Дата;
		Движение3.ДоговорКонтрагента = ДоговорИзОснования;
		Движение3.Сделка = Основание;
		Движение3.СуммаУпр = ТаблицаКурсовыхРазниц[0].СуммаУпрОстаток+К*СуммаИтог*КурсВзаиморасчетов;
        конецЕсли;
		
		
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		//найдем курс документа
	//курс берем из документа поступления по заказу
	если КурсВзаиморасчетов = 0 тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов как Курс
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Сделка = &Сделка";
	
	Запрос.УстановитьПараметр("Сделка", Основание);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда	
		//Если нет документа поступления смысла проводить документ нет
		отказ = Истина;
		Сообщить("Заполните договор!!!");
	иначе
		КурсВзаиморасчетов = Результат.Выгрузить()[0].Курс;
	конецЕсли;	
    конецЕсли;
КонецПроцедуры
